JeongJiMin-github/OneModule-trunk/UI/DispDrv_Efm32g840_Omv3_Tm_Lcd.c
/**
********************************************************************************
* Copyright (c) 2006 CAS
* @brief   Display Driver Source File\n
* @file    DispDrv_Efm32g840_Omv3_Tm_Lcd.c
* @version 1.0
* @date    2012/10/10
* @author  TAE WOO KOO (KTW)
********************************************************************************
* @remark  [Version History]\n
*          v1.0 2012/10/10 created by KTW \n
********************************************************************************
*/

/*
********************************************************************************
*                       INCLUDES
********************************************************************************
*/
/* Insert include files here */
#include "../Common/Globals.h"
#include "../Common/UiDefine.h"
#include "DispDrv.h"
#include "../Hardware/HardwareConfig.h"
#ifdef DISP_DRV_EFM32G840_OMV3_TM_LCD
#include "efm32_cmu.h"
/*
********************************************************************************
*                       GLOBAL(EXPORTED) VARIABLES & TABLES
********************************************************************************
*/
/* Insert global variables & tables here */


/*
********************************************************************************
*                       LOCAL DEFINITIONS & MACROS
********************************************************************************
*/

/* Insert #define here */
/** @brief Display 갯수*/
#define DISP_DRV_WIN_MAX_NUM	1

/** @brief Display driver buffer size*/
//#define DISP_DRV_BUF_SIZE	16
#define DISP_DRV_BUF_SIZE	16

#define EFM_DISP_DRV_BUF_SIZE	4


/** @brief Display driver module size*/
#define DSP_DRV_MODULE_SIZE	5
//#define DSP_DRV_MODULE_SIZE	9
/** @brief Display driver module string size*/
#define DSP_DRV_MODULE_STR_SIZE	5//

/** @brief Display driver weight address*/
#define DISP_DRV_WEIGHT_ADDR 1
/** @brief weight display size*/
#define DISP_DRV_WEIGHT_SIZE 5
//#define DISP_DRV_WEIGHT_SIZE 6

/** @brief weight display indicator address*/
#define DISP_DRV_WEIGHT_INDICATOR_ADDR 5//


//Dot addr is same as digit
//Triangle addr and mask
//   0 ~ 17
//	{8, 0x20}, {8, 0x10}, {7, 0x20}, {7, 0x10}, {6, 0x20}, {6, 0x10}, 
//	{17, 0x20}, {17, 0x10}, {16, 0x20}, {16, 0x10}, {15, 0x20}, {15, 0x10},
//	{26, 0x20}, {26, 0x10}, {25, 0x20}, {25, 0x10}, {24, 0x20}, {24, 0x10} 
//BackLight Indicator addr and mask
//  if total disp window
//  {8, 0x04}

//#define DISP_DRV_ADDR_WEIGHT_MINUS		{0, 0}//RB is minus sign is not exist, so use digit 0 for minus char
//#define DISP_DRV_ADDR_UNIT_PRICE_MINUS	{0xff, 0}//not exist
//#define DISP_DRV_ADDR_TOTAL_PRICE_MINUS	{0xff, 0}//not exist
//#define DISP_DRV_ADDR_TARE_MINUS		{0xff, 0}//not exist
//#define DISP_DRV_ADDR_ZERO				{8, 0x10}//triangle 1
//#define DISP_DRV_ADDR_STABLE			{0xff, 0}//not exist
//#define DISP_DRV_ADDR_NET				{7, 0x10}//triangle 3
//#define DISP_DRV_ADDR_LOW_BATT			{0xff, 0}//not exist

/** @brief MINUS indicator, RB is minus sign is not exist, so use digit 0 for minus char*/
#define DISP_DRV_ADDR_WEIGHT_MINUS		{0, 0x00}
/** @brief Stable indicator*/
#define DISP_DRV_ADDR_STABLE			{14, 0x01}
/** @brief NET indicator*/
#define DISP_DRV_ADDR_NET				{14, 0x04}
/** @brief Low Battery indicator*/
#define DISP_DRV_ADDR_LOW_BATT			{13, 0x01}
/** @brief Ounce indicator*/
#define DISP_DRV_ADDR_OZ				{0, 0x00}
/** @brief Ounce indicator*/
#define DISP_DRV_ADDR_N					{8, 0x01}
/** @brief Pound indicator*/
#define DISP_DRV_ADDR_LB				{7, 0x02}
/** @brief Kilo gram indicator*/
#define DISP_DRV_ADDR_KG				{8, 0x06}
/** @brief Gram indicator*/
#define DISP_DRV_ADDR_GRAM				{8, 0x04}
/** @brief PCS indicator, for counting*/
#define DISP_DRV_ADDR_PCS				{7, 0x01}
/** @brief Zero indicator*/
#define DISP_DRV_ADDR_ZERO				{14, 0x02}

/** @brief Zero indicator*/
#define DISP_DRV_ADDR_HOLD				{14, 0x08}

/** @brief Zero indicator*/
#define DISP_DRV_ADDR_TON				{7, 0x08} //X1000 + kg 
/** @brief Zero indicator*/
#define DISP_DRV_ADDR_SHORT_TON 		{7, 0x04} //T
/** @brief Zero indicator*/
#define DISP_DRV_ADDR_LONG_TON			{7, 0x04} //T
/** @brief Zero indicator*/
#define DISP_DRV_ADDR_NEWTON			{8, 0x01} //N
/** @brief Zero indicator*/
#define DISP_DRV_ADDR_KN				{8, 0x01} //k + N
/** @brief Zero indicator*/
#define DISP_DRV_ADDR_DAN				{7, 0x01} //da + N

/** @brief High indicator, for comparator*/
#define DISP_DRV_ADDR_HI				{13, 0x04}
/** @brief Low indicator, for comparator*/
#define DISP_DRV_ADDR_LOW				{13, 0x08}
/** @brief High indicator, for comparator*/


/** @brief OK indicator, for comparator*/
#define DISP_DRV_ADDR_OK				{13, 0x02}
/** @brief OK indicator, for counting*/
#define DISP_DRV_ADDR_LACK				{14, 0x00}
/*
	Font bit map
	---4---
	I0	 5I
	---1---
	I2	 6I
	---3---
*/
/** @brief FONT_SPACE*/
#define FONT_SPACE	0x00
/** @brief FONT_! , not exist*/
#define FONT_ASC33	0x00
/** @brief FONT_" , not exist*/
#define FONT_ASC34	0x00
/** @brief FONT_# , not exist*/
#define FONT_ASC35	0x00
/** @brief FONT_$ , not exist*/
#define FONT_ASC36	0x00
/** @brief FONT_% , not exist*/
#define FONT_ASC37	0x00
/** @brief FONT_& , not exist*/
#define FONT_ASC38	0x00
/** @brief FONT_' , not exist*/
#define FONT_ASC39	0x00
/** @brief FONT_( , not exist*/
#define FONT_ASC40	0x00
/** @brief FONT_) , not exist*/
#define FONT_ASC41	0x00
/** @brief FONT_* , not exist*/
#define FONT_ASC42	0x00
/** @brief FONT_+ , not exist*/
#define FONT_ASC43	0x00
/** @brief FONT_, , not exist*/
#define FONT_ASC44	0x00
/** @brief FONT_- , not exist*/
#define FONT_ASC45	0x04
/** @brief FONT_. , not exist*/
#define FONT_ASC46	0x00
/** @brief FONT_/ , not exist*/
#define FONT_ASC47	0x00

/** @brief FONT_0*/
#define FONT_0	0x7B
/** @brief FONT_1*/
#define FONT_1	0x28
/** @brief FONT_2*/
#define FONT_2	0x5E
/** @brief FONT_3*/
#define FONT_3	0x6E
/** @brief FONT_4*/
#define FONT_4	0x2D
/** @brief FONT_5*/
#define FONT_5	0x67
/** @brief FONT_6*/
#define FONT_6	0x77
/** @brief FONT_7*/
#define FONT_7	0x2B
/** @brief FONT_8*/
#define FONT_8	0x7F
/** @brief FONT_9*/
#define FONT_9	0x6F

