JeongJiMin-github/OneModule-trunk/UI/DispDrv_Efm32g840_Omv3_Tm_Lcd.c
/** @brief FONT_:, not exist*/
#define FONT_ASC58	0x00
/** @brief FONT_;, not exist*/
#define FONT_ASC59	0x00
/** @brief FONT_<, not exist*/
#define FONT_ASC60	0x00
/** @brief FONT_=, not exist*/
#define FONT_ASC61	0x00
/** @brief FONT_>, not exist*/
#define FONT_ASC62	0x00
/** @brief FONT_?, not exist*/
#define FONT_ASC63	0x00
/** @brief FONT_@, not exist*/
#define FONT_ASC64	0x00

//--------- Alphabet ------------------
/** @brief FONT_A*/
#define FONT_A   0x3F
/** @brief FONT_B*/
#define FONT_B   0x75
/** @brief FONT_C*/
#define FONT_C   0x53
/** @brief FONT_D*/
#define FONT_D   0x7C
/** @brief FONT_E*/
#define FONT_E   0x57
/** @brief FONT_F*/
#define FONT_F   0x17
/** @brief FONT_G*/
#define FONT_G   0x73
/** @brief FONT_H*/
#define FONT_H   0x3D
/** @brief FONT_I*/
#define FONT_I   0x20
/** @brief FONT_J*/
#define FONT_J   0x78
/** @brief FONT_K*/
#define FONT_K   0x15
/** @brief FONT_L*/
#define FONT_L   0x51
/** @brief FONT_M*/
#define FONT_M   0x36
/** @brief FONT_N*/
#define FONT_N   0x34
/** @brief FONT_O*/
#define FONT_O   0x74
/** @brief FONT_P*/
#define FONT_P   0x1F
/** @brief FONT_Q*/
#define FONT_Q   0x2F
/** @brief FONT_R*/
#define FONT_R   0x14
/** @brief FONT_S*/
#define FONT_S   0x67
/** @brief FONT_T*/
#define FONT_T   0x55
/** @brief FONT_U*/
#define FONT_U   0x79
/** @brief FONT_V*/
#define FONT_V   0x70
/** @brief FONT_W*/
#define FONT_W   0x72
/** @brief FONT_X*/
#define FONT_X   0x47
/** @brief FONT_Y*/
#define FONT_Y   0x6D
/** @brief FONT_Z*/
#define FONT_Z   0x5E

/** @brief FONT__*/
#define FONT_ASC91	0x00
/** @brief FONT__*/
#define FONT_ASC92	0x00
/** @brief FONT__*/
#define FONT_ASC93	0x00
/** @brief FONT__*/
#define FONT_ASC94	0x00
/** @brief FONT__*/
#define FONT_ASC95	0x40

/*
********************************************************************************
*                       LOCAL DATA TYPES & STRUCTURES
********************************************************************************
*/
/* Insert local typedef & structure here */
/** @brief Display Driver에서 Segment Display시 사용하는 struct */
typedef _PACKED_DEF struct
{
	/** @brief Image Memory Address */
	INT8U addr;
	/** @brief Image Memory Size */
	INT8U size;
} DISP_DRV_DATA;

/** @brief Display Driver에서 Indicator Display시 사용하는 struct */
typedef _PACKED_DEF struct
{
	/** @brief Image Memory Address */
	INT8U addr;
	/** @brief Image Memory Address에서 Indicator bit Mask */
	INT8U mask;
} INDICATOR_ADDR;
/*
********************************************************************************
*                       GLOBAL(FILE SCOPE) VARIABLES & TABLES
********************************************************************************
*/
/* Insert file scope variable & tables here */
/** @brief Display Driver에서 사용하는 Segment Font Table */
const INT8U code FontTable[64] =
{
	FONT_SPACE, FONT_ASC33, FONT_ASC34, FONT_ASC35, FONT_ASC36,
	FONT_ASC37, FONT_ASC38,	FONT_ASC39, FONT_ASC40, FONT_ASC41,
	FONT_ASC42, FONT_ASC43, FONT_ASC44, FONT_ASC45,	FONT_ASC46, FONT_ASC47,  // 32 - 47               
    FONT_0,		FONT_1,		FONT_2,		FONT_3,		FONT_4,
	FONT_5,		FONT_6,		FONT_7,		FONT_8,		FONT_9, // 48 - 57  Num 
    FONT_ASC58, FONT_ASC59, FONT_ASC60, FONT_ASC61, FONT_ASC62,
	FONT_ASC63, FONT_ASC64,  // 58 - 64  
    FONT_A,		FONT_B,		FONT_C,		FONT_D,		FONT_E,		FONT_F,		FONT_G, 
    FONT_H,		FONT_I,		FONT_J,		FONT_K,		FONT_L,		FONT_M,		FONT_N, 
    FONT_O,		FONT_P,		FONT_Q,		FONT_R,		FONT_S,		FONT_T,		FONT_U,         
    FONT_V,		FONT_W,		FONT_X,		FONT_Y,		FONT_Z,		FONT_ASC91, FONT_ASC92, 
    FONT_ASC93,	FONT_ASC94, FONT_ASC95	//  65 -95  alphabet & underbar
};
/** @brief Display Driver에서 Segment Display시 사용하는 struct Window 개수 만큼 존재 */
static DISP_DRV_DATA dispDrvStruct[WIN_MAX_NUM];

/** @brief Image Buffer : 실제 Display Driver IC에 존재하는 메모리의 복사본 */
static INT32U idata efm32DispDrvBuf[DISP_DRV_PAGE_SIZE][EFM_DISP_DRV_BUF_SIZE];


/** @brief Display Driver Mode */
static INT8U dispDrvMode;
/** @brief Display Driver IC에 보낼 Image Buffer 번호 */
static INT8U dispTransPage;
/** @brief Display Driver에서 Edit시 사용하는 Image Buffer 번호 */
static INT8U dispEditingPage;

/** 
* @brief Display Driver에서 Indicator Display시 사용하는 struct, Indicator 개수 만큼 존재 
* @remark 배열에서 Indicator위치는 define되어 있음\n
*         임의로 위치 변경하지 마시오.
*         관련 정의를 보려면 DISP_DRV_ADDR_WEIGHT_MINUS를 찾아 보시오.
*/
const INDICATOR_ADDR code dispDrvIndicatorAddrTable[INDICATOR_MAX_NUM] =
{
	DISP_DRV_ADDR_WEIGHT_MINUS,			///0	Weight Minus
	{0, 0},								///1 Unit price Minus
	{0, 0},								///2 Total price Minus
	{0, 0},								///3 Tare Minus
	DISP_DRV_ADDR_ZERO,					///4 Zero
	DISP_DRV_ADDR_STABLE,				///5 Stable
	DISP_DRV_ADDR_NET,					///6 Net
	DISP_DRV_ADDR_LOW_BATT,				///7 Low battery
	DISP_DRV_ADDR_OZ,					///8 Ounce
	DISP_DRV_ADDR_LB,					///9 Pound
	DISP_DRV_ADDR_KG,					//10 Kilo gram
	DISP_DRV_ADDR_GRAM,					//11 Gram	DISP_DRV_ADDR_GRAM
	DISP_DRV_ADDR_PCS,					//12 Counting mode
	{0, 0},								//13 Prepack
	DISP_DRV_ADDR_HI,					//14 Compare high
	DISP_DRV_ADDR_LOW,					//15 Compare low
	DISP_DRV_ADDR_OK,					//16 Compare OK	
	{0, 0},								//17 Euro
	DISP_DRV_ADDR_HOLD,					//18 Hold
	{0, 0},								//19 Backlight
	DISP_DRV_ADDR_LACK,					//20 Counting lack
	{0, 0},								//21 Unit price 100Gram
	{0, 0}, 							//22 Tare save
	{0, 0},                             //23 Both save   
    {0, 0},                             //24 Unit price Kilo Gram       
    {0, 0},                             //25 Unit price Pound   
	{0, 0},								//26 Percent
	{0, 0},								//27 Sum
	{0, 0},								//28 full battery
	{0, 0},								//29 charging battery
	{0, 0},								//30 Euro per Kilogram
	{0, 0},								//31 $
	{0, 0},								//32 $/kg
	{0, 0},								//33 Unit price oz
	{0, 0},								//34 Connected AC
	{0, 0},								//35 reserved
	{0, 0},								//36 reserved    
	{0, 0},								//37 reserved
	{0, 0},								//38 reserved
	{0, 0},								//39 reserved
	{0, 0},								//40 reserved
	{0, 0},								//41 reserved
	{0, 0},								//42 reserved
	{0, 0},								//43 reserved
	{0, 0},								//44 reserved
	{0, 0},								//45 reserved
	{0, 0},								//46 reserved
	{0, 0},								//47 reserved
	{0, 0},								//48 reserved
	{0, 0},								//49 reserved
    DISP_DRV_ADDR_TON,                  //50 ton(matric)
    DISP_DRV_ADDR_SHORT_TON,            //51 ton(short)
    DISP_DRV_ADDR_LONG_TON,             //52 ton(long)
    DISP_DRV_ADDR_NEWTON,               //53 Newton
    DISP_DRV_ADDR_KN,                   //54 kN
    DISP_DRV_ADDR_DAN                   //55 daN
};

/** @brief Dot addr and mask*/
const INDICATOR_ADDR code dispDrvDotAddrTable[5] =
{
	{1, 0x08}, {4, 0x08}, {6, 0x08}, {10, 0x08}, {0, 0x00}
};

