JeongJiMin-github/OneModule-trunk/UI/DispDrv_Efm32g840_Omv3_Tm_Lcd.c
	for (page = 0; page < EFM_DISP_DRV_BUF_SIZE; page++) 
	{
		for (addr = 0; addr < EFM_DISP_DRV_BUF_SIZE; addr++) 
		{
			efm32DispDrvBuf[page][addr] = 0x00;
		}
	}

    LCD->SEGD0L = 0x00000000;
    LCD->SEGD0H = 0x00000000;
    LCD->SEGD1L = 0x00000000;
    LCD->SEGD1H = 0x00000000;
    LCD->SEGD2L = 0x00000000;
    LCD->SEGD2H = 0x00000000;
    LCD->SEGD3L = 0x00000000;
    LCD->SEGD3H = 0x00000000;

}

/**
********************************************************************************
* @brief    window에 1 문자 출력하는 함수 (editting Page)
* @param    winNum : Window 번호\n
*           pos : Window에서 위치 (0~ )
*           cdata : 문자 data
* @return   none
* @remark   
********************************************************************************
*/
void DispDrvSetChar(INT8U winNum, INT8U pos, char cdata)
{
	
  	INT8U byte;
	INT8U addr;
	INT32U mask;
    INT8U i=0;
    INT8U dataTemp=0;

	addr = dispDrvCharAddrTable[pos];
	byte = FontTable[cdata - 0x20];
    //mask = efm32DispDrvBuf[dispEditingPage][3] & (0x1<<addr);       // 숮자 문자 표현중 BAT을 masking하기 위해 duckspg
	mask = efm32DispDrvBuf[dispEditingPage][3] & (0x1>>addr);       // 숮자 문자 표현중 BAT을 masking하기 위해 duckspg
    for(i=0 ; i<4 ; i++)
    {
        // 변경 fonttable           두개씩 짝을 지어서 재배열 
        efm32DispDrvBuf[dispEditingPage][i] = (efm32DispDrvBuf[dispEditingPage][i] & ~(0x3<<addr)) | ((byte>>(i<<1))&0x03)<<addr;
        // 기존 fonttable
//        efm32DispDrvBuf[dispEditingPage][i] = (efm32DispDrvBuf[dispEditingPage][i] & ~(0x3<<addr)) | (((byte & (0x10<<i))>>(4+i))<<(addr));
//        efm32DispDrvBuf[dispEditingPage][i] = (efm32DispDrvBuf[dispEditingPage][i]) | (((byte & (0x01<<i))>>i)<<(addr+1));
    }
    //efm32DispDrvBuf[dispEditingPage][3] = efm32DispDrvBuf[dispEditingPage][3] | mask;
	efm32DispDrvBuf[dispEditingPage][3] = efm32DispDrvBuf[dispEditingPage][3];	//TM-300 BAT을 켜기 위해서는 수정하여야 함
	
	/*
	INT8U byte;
	INT8U addr;
	INT8U	tmp8u[4];
	

	addr = dispDrvCharAddrTable[pos];
	byte = FontTable[cdata - 0x20];

	tmp8u[0] = ((byte&0x80)>>6) | ((byte&0x08))>>3;
	tmp8u[1] = ((byte&0x40)>>5) | ((byte&0x04))>>2; 
	tmp8u[2] = ((byte&0x20)>>4) | ((byte&0x02))>>1; 
	tmp8u[3] = ((byte&0x10)>>3) | ((byte&0x01));
		

	efm32DispDrvBuf[dispEditingPage][0] = (efm32DispDrvBuf[dispEditingPage][0] & ~(0x03 << addr)) | (tmp8u[0] << addr);
	efm32DispDrvBuf[dispEditingPage][1] = (efm32DispDrvBuf[dispEditingPage][1] & ~(0x03 << addr)) | (tmp8u[1] << addr);
	efm32DispDrvBuf[dispEditingPage][2] = (efm32DispDrvBuf[dispEditingPage][2] & ~(0x03 << addr)) | (tmp8u[2] << addr);
	efm32DispDrvBuf[dispEditingPage][3]	= (efm32DispDrvBuf[dispEditingPage][3] & ~(0x03 << addr)) | (tmp8u[3] << addr);
	*/
	
}

/**
********************************************************************************
* @brief    Editting Image에 입력 받은 문자로 채움
* @param    fillChar : 채울 문자
* @return   none
* @remark   
********************************************************************************
*/
void DispDrvFillChar(char fillChar)
{
	INT8U winNum;
	INT8U pos;
	INT8U size;

	for (winNum = 0; winNum < DISP_DRV_WIN_MAX_NUM; winNum++)
	{
		size = dispDrvStruct[winNum].size;
		for (pos = 0; pos < size; pos++) 
		{
			DispDrvSetChar(winNum, pos, fillChar);
		}
	}
}

/**
********************************************************************************
* @brief    Editting Image에 모든 Indicator 제어 함수
* @param    on : 1 -> 켬, 0 -> 끔
* @return   none
* @remark   
********************************************************************************
*/
void DispDrvSetAllIndicator(INT8U on)
{
	INT8U winNum;
	INT8U pos;
	INT8U size;

	for (pos = 0; pos < INDICATOR_MAX_NUM; pos++)
	{
		DispDrvSetIndicator(pos, on);
	}
	for (winNum = 0; winNum < DISP_DRV_WIN_MAX_NUM; winNum++)
	{	
		size = dispDrvStruct[winNum].size;
		for (pos = 0; pos < size; pos++)
		{
			dispDrvSetDot(winNum, pos, on);
			dispDrvSetComma(winNum, pos, on);
		}
	}
}

/**
********************************************************************************
* @brief    Window에 String 출력 (editting Page)
* @param    winNum : Window 번호\n
*           str : 출력할 String Pointer
* @return   none
* @remark   str 채운후 남는 부분은 space로 채움
********************************************************************************
*/
void DispDrvSetStr(INT8U winNum, char *str)
{
	INT8U i;
	INT8U dispChar;
	INT8U byte;
	INT8U addr;
	INT8U strEndFlag;
	INT8U dataSize;
	INT8U mask;

	if (winNum > DISP_DRV_WIN_MAX_NUM - 1) 
	{
		return;
	}

	strEndFlag = 0;

	dataSize = dispDrvStruct[winNum].size;

	for (i = 0; i < dataSize; i++) 
	{
		if ((str[i] == 0x00) || (strEndFlag == 1)) 
		{
			strEndFlag = 1;
			dispChar = 0x20;
		}
		else 
		{
			dispChar = str[i];
		}
		if (dispChar >= 'a' && dispChar <= 'z')
		{
			dispChar = dispChar - 0x20;	//('A' = 'a' - 0x20) 소문자->대문자
		}
		if (dispChar < 0x20 || dispChar > 'Z')
		{
			//dispChar = 0x20;	//space
		  dispChar = 0x00;	//space
		}


        DispDrvSetChar(winNum,i,dispChar);
	}
}

/**
********************************************************************************
* @brief    Window에 Const String 출력 (editting Page)
* @param    winNum : Window 번호\n
*           str : 출력할 Const String Pointer
* @return   none
* @remark   str 채운후 남는 부분은 space로 채움
********************************************************************************
*/
void DispDrvSetConstStr(INT8U winNum, const char *str)
{
	INT8U i;
	INT8U dispChar;
	INT8U byte;
	INT8U addr;
	INT8U strEndFlag;
	INT8U dataSize;
	INT8U mask;

	if (winNum > DISP_DRV_WIN_MAX_NUM - 1)
	{
		return;
	}
	strEndFlag = 0;
	dataSize = dispDrvStruct[winNum].size;

	for (i = 0; i < dataSize; i++) 
	{
		if ((str[i] == 0x00) || (strEndFlag == 1)) 
		{
			strEndFlag = 1;
			dispChar = 0x20;
		}
		else 
		{
			dispChar = str[i];
		}
		if (dispChar >= 'a' && dispChar <= 'z')
		{
			dispChar = dispChar - 0x20;	//('A' = 'a' - 0x20) 소문자->대문자
		}
		if (dispChar < 0x20 || dispChar > 'Z')
		{
			dispChar = 0x20;	//space
		}
        DispDrvSetChar(winNum,i,dispChar);
	}
}

/**
********************************************************************************
* @brief    Window에 Decimal Point Position, Type 값을 Setting (editting Page)
* @param    winNum : Window 번호\n
*           decPos : Decimal Point Position\n
*           decType : Decimal Point Type\n
*           useThousandPt : use flag for thousnad point
* @return   Decimal Point Type
* @remark   position : xxx -> 0, xx.x -> 1, x,xx -> 2
*           type : DEC_TYPE_DOT, DEC_TYPE_COMMA
********************************************************************************
*/
void DispDrvSetDecPoint(INT8U winNum, INT8U decPos, INT8U decType, INT8U useThousandPt)
{
	INT8U i;
	INT8U size;

	if (winNum > DISP_DRV_WIN_MAX_NUM - 1)
	{
		return;
	}
	
	size = dispDrvStruct[winNum].size;
	
	for (i = 0; i < size; i++)
	{
		dispDrvSetDot(winNum, i, OFF);
		dispDrvSetComma(winNum, i, OFF);
	}

	if (decPos == 0xff)//date/time
	{
		dispDrvSetDot(winNum, 2, ON);
		dispDrvSetComma(winNum, 2, ON);
		dispDrvSetDot(winNum, 4, ON);
		dispDrvSetComma(winNum, 4, ON);
		return;
	}

	if (decPos != 0)
	{
		dispDrvSetDot(winNum, decPos, ON);
		if (decType == DEC_TYPE_COMMA)
		{
			dispDrvSetComma(winNum, decPos, ON);
		}
	}

