JeongJiMin-github/OneModule-trunk/UI/DispDrv_Efm32g840_Omv3_Tm_Lcd.c
	if ((useThousandPt == 1) && ((decPos + 3) < size))
	{
		dispDrvSetDot(winNum, 3 + decPos, ON);
		dispDrvSetComma(winNum, 3 + decPos, ON);
	}
}

/**
********************************************************************************
* @brief    Indicator on/off setting 함수 (editting Page)
* @param    num : Indicator 번호\n
*           on : 1 -> 켜기, 0 -> 끄기
* @return   none
* @remark   Indicator 번호 정의되어 있음 (INDICATOR_WEIGHT_MINUS...)
********************************************************************************
*/
void DispDrvSetIndicator(INT8U num, INT8U on)
{
  	INT8U addr;
	INT8U mask;
	INT8U prevOnNum;
    INT8U i;
    
	addr = dispDrvIndicatorAddrTable[num].addr;
	mask = dispDrvIndicatorAddrTable[num].mask;

    for (i = 0; i<4 ; i++)
    {
        if (mask & (0x01<<i))
        {
            if (on)
            {
                efm32DispDrvBuf[dispEditingPage][i] = efm32DispDrvBuf[dispEditingPage][i] | (0x01<<addr);
            }
            else
            {
                efm32DispDrvBuf[dispEditingPage][i] = efm32DispDrvBuf[dispEditingPage][i] & ~(0x01<<addr);
            }
        }
    }
    
    if (num == INDICATOR_DAN || num == INDICATOR_TON|| num == INDICATOR_KN)
    {    
      
        switch (num)
        {
            case INDICATOR_DAN:
                num = INDICATOR_NEWTON;
                break;
            case INDICATOR_TON:
                num = INDICATOR_KG;
                break;
             case INDICATOR_KN:
                num = INDICATOR_TON;
                break;
        }
        
        addr = dispDrvIndicatorAddrTable[num].addr;
        mask = dispDrvIndicatorAddrTable[num].mask;
    
        for (i = 0; i<4 ; i++)
        {
            if (mask & (0x01<<i))
            {
                if (on)
                {
                    efm32DispDrvBuf[dispEditingPage][i] = efm32DispDrvBuf[dispEditingPage][i] | (0x01<<addr);
                }
                else
                {
                    efm32DispDrvBuf[dispEditingPage][i] = efm32DispDrvBuf[dispEditingPage][i] & ~(0x01<<addr);
                }
            }
        }
    }    
}


/**
********************************************************************************
* @brief    Bettery Energy Indicator setting 함수 (editting Page)
* @param    percent : Battery 양 (%)\n
* @return   none
* @remark   SW don't use
********************************************************************************
*/
void DispDrvSetBattEnergy(INT8U percent)
{

}

/**
********************************************************************************
* @brief    Display Driver Procedure\n
* @param    none
* @return   none
* @remark   dispTransPage의 Image를 Display Driver IC로 전송
********************************************************************************
*/
void DispDrvProc(void)
{
    INT8U i = 0;
    
    while (LCD->SYNCBUSY) ;
    LCD->FREEZE = LCD_FREEZE_REGFREEZE_FREEZE;
    
    LCD->SEGD0L &= 0x80000000;
    LCD->SEGD1L &= 0x80000000;
    LCD->SEGD2L &= 0x80000000;
    LCD->SEGD3L &= 0x80000000;
    
    
    for (i = 0 ; i<4 ; i++)
    {
        lcdEnableSegment(i,efm32DispDrvBuf[dispTransPage][i]);
    }
    LCD->FREEZE = LCD_FREEZE_REGFREEZE_UPDATE;
}

/**
********************************************************************************
* @brief    Display Driver Procedure\n
* @param    none
* @return   none
* @remark   dispTransPage의 Image를 Display Driver IC로 전송
********************************************************************************
*/
void DispDrvTurnOnOff(BOOLEAN onOff)
{
}

/**
********************************************************************************
* @brief    Display Driver BrightnessLevel\n
* @param    none
* @return   none
* @remark   
********************************************************************************
*/
void DispDrvSetBright(INT8U level)
{	
}

/*
********************************************************************************
*                       LOCAL FUNCTIONS
********************************************************************************
*/
/* Insert local functions here */
/**
********************************************************************************
* @brief    Dot Indicator setting 함수 (editting Page)
* @param    winNum : Window 번호\n
*           decPos : Decimal Point Position\n
*           on : 1 -> on, 0 -> off
* @return   none
* @remark   
********************************************************************************
*/
void dispDrvSetDot(INT8U winNum, INT8U decPos, INT8U on)
{
	INT8U addr;
	INT8U mask;
	INT8U pos;
    INT8U i;

	pos = dispDrvStruct[winNum].size - decPos - 1;

	addr = dispDrvDotAddrTable[pos].addr;
	mask = dispDrvDotAddrTable[pos].mask;

    for (i = 0; i<4 ; i++)
    {
        if (mask & (0x01<<i))
        {
            if (on)
            {
                efm32DispDrvBuf[dispEditingPage][i] = efm32DispDrvBuf[dispEditingPage][i] | (0x01<<addr);
            }
            else
            {
                efm32DispDrvBuf[dispEditingPage][i] = efm32DispDrvBuf[dispEditingPage][i] & ~(0x01<<addr);
            }
        }
    }
}

/**
********************************************************************************
* @brief    Comma Indicator setting 함수 (editting Page)
* @param    winNum : Window 번호\n
*           decPos : Decimal Point Position\n
*           on : 1 -> on, 0 -> off
* @return   none
* @remark   
********************************************************************************
*/
void dispDrvSetComma(INT8U winNum, INT8U decPos, INT8U on)
{
	INT8U addr;
	INT8U mask;
	INT8U pos;
    INT8U i;

	pos = dispDrvStruct[winNum].size - decPos - 1;

	addr = dispDrvCommaAddrTable[pos].addr;
	mask = dispDrvCommaAddrTable[pos].mask;

    for (i = 0; i<4 ; i++)
    {
        if (mask & (0x01<<i))
        {
            if (on)
            {
                efm32DispDrvBuf[dispEditingPage][i] = efm32DispDrvBuf[dispEditingPage][i] | (0x01<<addr);
            }
            else
            {
                efm32DispDrvBuf[dispEditingPage][i] = efm32DispDrvBuf[dispEditingPage][i] & ~(0x01<<addr);
            }
        }
    }
}
/**
********************************************************************************
* @brief    LCD boost 함수
* @param    true  : boost
*           false : not boost
* @return   none
* @remark   lcd 파워가 떨어질때 BOOST를 하고 강제로 올릴수 있는 함수 
********************************************************************************
*/
void lcd_UseBoost(BOOLEAN useBoost)
{
  /* Frame rate is 32Hz, 0.25Khz LFCLK128, QUADRUPLEX mode, FDIV=0 */
  if (!useBoost)
  {
    /* No voltage boost, framerate 32Hz */
    CMU->LCDCTRL = 0;

