JeongJiMin-github/OneModule-trunk/UI/DispDrv_Efm32g840_Omv3_Tm_Lcd.c
    LCD->DISPCTRL = LCD_DISPCTRL_MUX_QUADRUPLEX |
                    LCD_DISPCTRL_BIAS_ONETHIRD |
                    LCD_DISPCTRL_WAVE_LOWPOWER |
                    LCD_DISPCTRL_CONLEV_MAX |
                    LCD_DISPCTRL_VLCDSEL_VDD |
                    LCD_DISPCTRL_VBLEV_LEVEL0;
  }
  else
  {
    /* CMU->LCDCTRL voltage boost frequency set to default 8KHz */
    CMU->LCDCTRL  = CMU_LCDCTRL_VBOOSTEN;
    LCD->DISPCTRL = LCD_DISPCTRL_MUX_QUADRUPLEX |
                    LCD_DISPCTRL_BIAS_ONETHIRD |
                    LCD_DISPCTRL_WAVE_LOWPOWER |
                    LCD_DISPCTRL_CONLEV_MAX |
                    LCD_DISPCTRL_VLCDSEL_VEXTBOOST |
                    LCD_DISPCTRL_VBLEV_LEVEL0;
  }
}
/**
********************************************************************************
* @brief    lcd enable segment 함수
* @param    com   bitvalue
* @return   none
* @remark   LCD 레지스터를 직접 써서 LCD컨트롤을 해줌 마지막에 이것을 꼭해야 LCD가 동작함
********************************************************************************
*/
void lcdEnableSegment(INT32U com, INT32U bitValue)
{
    INT32U bitValueTemp = 0;
    
    bitValueTemp = ((bitValue<<4) | (bitValue&0xf));
//    bitValueTemp = (((bitValue<<2) & ~0xff) | (bitValue&0x3f));        // duckspg lcd seg 변경 

    switch (com)
    {
        case 0:
            LCD->SEGD0L |= bitValueTemp;        // duckspg lcd com 변경
            break;
        case 1:
            LCD->SEGD1L |= bitValueTemp;
            break;
        case 2:
            LCD->SEGD2L |= bitValueTemp;
            break;
        case 3:
            LCD->SEGD3L |= bitValueTemp;
            break;
        case 4:
            LCD->SEGD0H |= bitValueTemp;
            break;
        case 5:
            LCD->SEGD1H |= bitValueTemp;
            break;
        case 6:
            LCD->SEGD2H |= bitValueTemp;
            break;
        case 7:
            LCD->SEGD3H |= bitValueTemp;
            break;
    }
}




#endif//#ifdef DISP_DRV_HT1621_DB2


